doc/html/handlers/query.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Query Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Query Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:20 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Query Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Query Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Query Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
The query handler controls how Nitrogen's <code>wf:q</code> and its siblings (<code>wf:qs</code>, <code>wf:mq</code>, <code>wf:mqs</code>) retrieves values from POST, GET, or other methods.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>get_value(Key, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>
  This function should define how a querystring (GET) or form (POST) value is
  retrieved based on the provided <code>Key</code>. Note: this assumes a single value will
  be found for the provided key.
</p>
<ul>
<li><code>Key</code> - The key to find

</li>
<li><i>Return Value</i> - The value found for the provided <code>Key</code>.

</li>
<li><i>Note:</i> This will throw an error if more than one value is found for the 
    <code>Key</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-5">
<h5 id="sec-1-1-4"><span class="section-number-5"></span> <code>get_values(Key, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-4">


<p>
  This function should define how a querystring (GET) or form (POST) value is
  retrieved based on the provided <code>Key</code>. Note: this works
</p>
<ul>
<li><code>Key</code> - The key to find

</li>
<li><i>Return Value</i> - Description of the return 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-5" class="outline-5">
<h5 id="sec-1-1-5"><span class="section-number-5"></span> <code>get_params(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-5">


<ul>
<li><i>Return Value</i> - This function returns an Erlang
</li>
</ul>

<p>  <a href="http://www.erlang.org/doc/man/proplists.html">proplist</a> (a list of 
  key-value pairs, ie <code>[{Key,Value},...]</code>) of all the request variables and
  their values.
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Here is the complete text of the default_query_handler:
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (default_query_handler).
<span class="org-preprocessor">-behaviour</span> (query_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">get_value/3</span>,
    <span class="org-type">get_values/3</span>,
    <span class="org-type">get_params/2</span>
]).

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Get query params and post params</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">from the request bridge...</span>
    <span class="org-variable-name">RequestBridge</span> = <span class="org-type">wf_context</span>:<span class="org-type">request_bridge</span>(),
    <span class="org-variable-name">QueryParams</span> = <span class="org-variable-name">RequestBridge</span>:<span class="org-type">query_params</span>(),
    <span class="org-variable-name">PostParams</span> = <span class="org-variable-name">RequestBridge</span>:<span class="org-type">post_params</span>(),

    <span class="org-comment-delimiter">% </span><span class="org-comment">Load into state...</span>
    <span class="org-variable-name">Params</span> = <span class="org-variable-name">QueryParams</span> ++ <span class="org-variable-name">PostParams</span>,

    <span class="org-comment-delimiter">% </span><span class="org-comment">Pre-normalize the parameters.</span>
    <span class="org-variable-name">Params1</span> = [{<span class="org-type">normalize_path</span>(<span class="org-variable-name">Path</span>), <span class="org-variable-name">Value</span>} <span class="org-keyword">||</span> {<span class="org-variable-name">Path</span>, <span class="org-variable-name">Value</span>} <span class="org-keyword">&lt;-</span> <span class="org-variable-name">Params</span>, <span class="org-variable-name">Path</span> /= undefined, <span class="org-variable-name">Path</span> /= []],
    {ok, <span class="org-variable-name">Params1</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Clear out the state.</span>
    {ok, []}.

<span class="org-comment-delimiter">%% </span><span class="org-comment">Given a path, return the value that matches the path.</span>
<span class="org-function-name">get_value</span>(<span class="org-variable-name">Path</span>, <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-keyword">case</span> <span class="org-type">get_values</span>(<span class="org-variable-name">Path</span>, <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) <span class="org-keyword">of</span>
        [] -&gt;<span class="org-function-name"> </span>undefined;
        [<span class="org-variable-name">One</span>] -&gt;<span class="org-function-name"> </span><span class="org-variable-name">One</span>;
        <span class="org-variable-name">_Many</span> -&gt;<span class="org-function-name"> </span><span class="org-builtin">throw</span>({?<span class="org-constant">MODULE</span>, too_many_matches, <span class="org-variable-name">Path</span>})
    <span class="org-keyword">end</span>.

<span class="org-function-name">get_values</span>(<span class="org-variable-name">Path</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">Params</span> = <span class="org-variable-name">State</span>,
    <span class="org-variable-name">Path1</span> = <span class="org-type">normalize_path</span>(<span class="org-variable-name">Path</span>),
    <span class="org-type">refine_params</span>(<span class="org-variable-name">Path1</span>, <span class="org-variable-name">Params</span>).

<span class="org-function-name">get_params</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">Params</span> = <span class="org-variable-name">State</span>,
    <span class="org-variable-name">F</span> = <span class="org-keyword">fun</span>({<span class="org-variable-name">KeyPartsReversed</span>, <span class="org-variable-name">Value</span>}) -&gt;
        <span class="org-variable-name">KeyParts</span> = <span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-variable-name">KeyPartsReversed</span>),
        <span class="org-variable-name">Key</span> = <span class="org-type">string</span>:<span class="org-type">join</span>(<span class="org-variable-name">KeyParts</span>, <span class="org-string">"."</span>),
        { <span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span> }
    <span class="org-keyword">end</span>,
    <span class="org-type">lists</span>:<span class="org-type">map</span>(<span class="org-variable-name">F</span>, <span class="org-variable-name">Params</span>).

<span class="org-comment-delimiter">%% </span><span class="org-comment">Next, narrow down the parameters by keeping only the parameters</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">that contain the next element found in path, while shrinking the</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">parameter paths at the same time.</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">For example, if:</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">Path   = [a, b, c]</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">Params = [{[x, a, y, b, c], _}]</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">Then after the first round of refine_params/2 we would have:</span>
<span class="org-comment-delimiter">%%   </span><span class="org-comment">Path   = [b, c]</span>
<span class="org-comment-delimiter">%%   </span><span class="org-comment">Params = [y, b, c]</span>
<span class="org-function-name">refine_params</span>([], <span class="org-variable-name">Params</span>) -&gt;
    [<span class="org-variable-name">V</span> <span class="org-keyword">||</span> {<span class="org-variable-name">_</span>, <span class="org-variable-name">V</span>} <span class="org-keyword">&lt;-</span> <span class="org-variable-name">Params</span>];
<span class="org-function-name">refine_params</span>([<span class="org-variable-name">H</span>|<span class="org-variable-name">T</span>], <span class="org-variable-name">Params</span>) -&gt;
    <span class="org-variable-name">F</span> = <span class="org-keyword">fun</span>({<span class="org-variable-name">Path</span>, <span class="org-variable-name">Value</span>}, <span class="org-variable-name">Acc</span>) -&gt;
        <span class="org-keyword">case</span> <span class="org-type">split_on</span>(<span class="org-variable-name">H</span>, <span class="org-variable-name">Path</span>) <span class="org-keyword">of</span>
            {ok, <span class="org-variable-name">RemainingPath</span>} -&gt;<span class="org-function-name"> </span>[{<span class="org-variable-name">RemainingPath</span>, <span class="org-variable-name">Value</span>}|<span class="org-variable-name">Acc</span>];
            false -&gt;<span class="org-function-name"> </span><span class="org-variable-name">Acc</span>
        <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>,
    <span class="org-variable-name">Params1</span> = <span class="org-type">lists</span>:<span class="org-type">foldl</span>(<span class="org-variable-name">F</span>, [], <span class="org-variable-name">Params</span>),
    <span class="org-type">refine_params</span>(<span class="org-variable-name">T</span>, <span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-variable-name">Params1</span>)).

<span class="org-function-name">split_on</span>(<span class="org-variable-name">_</span>,  []) -&gt;<span class="org-function-name"> </span>false;
<span class="org-function-name">split_on</span>(<span class="org-variable-name">El</span>, [<span class="org-variable-name">El</span>|<span class="org-variable-name">T</span>]) -&gt;<span class="org-function-name"> </span>{ok, <span class="org-variable-name">T</span>};
<span class="org-function-name">split_on</span>(<span class="org-variable-name">El</span>, [<span class="org-variable-name">_</span>|<span class="org-variable-name">T</span>]) -&gt;<span class="org-function-name"> </span><span class="org-type">split_on</span>(<span class="org-variable-name">El</span>, <span class="org-variable-name">T</span>).

<span class="org-function-name">normalize_path</span>(<span class="org-variable-name">Path</span>) <span class="org-keyword">when</span> <span class="org-builtin">is_atom</span>(<span class="org-variable-name">Path</span>) -&gt;
    <span class="org-type">normalize_path</span>(<span class="org-builtin">atom_to_list</span>(<span class="org-variable-name">Path</span>));

<span class="org-function-name">normalize_path</span>(<span class="org-variable-name">Path</span>) <span class="org-keyword">when</span> ?<span class="org-constant">IS_STRING</span>(<span class="org-variable-name">Path</span>) -&gt;
    <span class="org-variable-name">Tokens</span> = <span class="org-type">string</span>:<span class="org-type">tokens</span>(<span class="org-variable-name">Path</span>, <span class="org-string">"."</span>),
    <span class="org-variable-name">Tokens1</span> = [<span class="org-type">strip_wfid</span>(<span class="org-variable-name">X</span>) <span class="org-keyword">||</span> <span class="org-variable-name">X</span> <span class="org-keyword">&lt;-</span> <span class="org-variable-name">Tokens</span>],
    <span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-variable-name">Tokens1</span>).

<span class="org-comment-delimiter">%% </span><span class="org-comment">Most tokens will start with "wfid_". Strip this out.</span>
<span class="org-function-name">strip_wfid</span>(<span class="org-variable-name">Path</span>) -&gt;
    <span class="org-keyword">case</span> <span class="org-variable-name">Path</span> <span class="org-keyword">of</span>
        <span class="org-string">"wfid_"</span> ++ <span class="org-variable-name">S</span> -&gt;<span class="org-function-name"> </span><span class="org-variable-name">S</span>;
        <span class="org-variable-name">S</span> -&gt;<span class="org-function-name"> </span><span class="org-variable-name">S</span>
    <span class="org-keyword">end</span>.


</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-10">API: Web Request and Response</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:20 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/query.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
